In [306]:
import pandas as pd
import numpy as np
from pandasql import sqldf
import re
from datetime import datetime 
import os

In [268]:
os.listdir('classicmodels/csv')

['customer.csv',
 'order.csv',
 'orderdetail.csv',
 'employee.csv',
 'product.csv',
 'office.csv']

![Drag Racing](picture/MySQL-Sample-Database-Schema.png)

In [269]:
customer = pd.read_csv('classicmodels/csv/customer.csv')
order = pd.read_csv('classicmodels/csv/order.csv')
orderdetail = pd.read_csv('classicmodels/csv/orderdetail.csv')
employee = pd.read_csv('classicmodels/csv/employee.csv')
product = pd.read_csv('classicmodels/csv/product.csv')
office = pd.read_csv('classicmodels/csv/office.csv')

#### Mostra i modellini che costano meno di 75$

In [270]:
df = product[product['MSRP'] < 75]
df.head(3)

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
19,S18_1367,1936 Mercedes-Benz 500K Special Roadster,Vintage Cars,1:18,Studio M Art Models,This 1:18 scale replica is constructed of heav...,8635,24.26,53.91
26,S18_2248,1911 Ford Town Car,Vintage Cars,1:18,Motor City Art Classics,"Features opening hood, opening doors, opening ...",540,33.30,60.54
29,S18_2432,1926 Ford Fire Engine,Trucks and Buses,1:18,Carousel DieCast Legends,Gleaming red handsome appearance. Everything i...,2018,24.92,60.77

#### Mostra nome, prezzo di acquisto e di vendita dei modellini che costano meno di 75

In [271]:
df = product[product['MSRP'] < 75][['productName', 'buyPrice', 'MSRP']]
df.head(3)

                                 productName  buyPrice   MSRP
19  1936 Mercedes-Benz 500K Special Roadster     24.26  53.91
26                        1911 Ford Town Car     33.30  60.54
29                     1926 Ford Fire Engine     24.92  60.77

#### Mostra tutti i dipendenti di nome Leslie

In [272]:
df = employee[employee['firstName'] == 'Leslie']

#### Mostra tutti i dipendenti il cui cognome finisce per son

In [273]:
df = employee[employee['lastName'].str.endswith('son')]
df

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
7,1166,Thompson,Leslie,x4065,lthompson@classicmodelcars.com,1,1143.0,Sales Rep
9,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep

#### Mostra tutti i dipendenti il cui cognome non finisce per son

In [274]:
df = employee[~employee['lastName'].str.endswith('son')]
df.head(3)

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002.0,VP Marketing
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)

#### Mostra tutti i dipendenti il cui nome finisce per "Arry" e davanti ha una sola lettera

In [275]:
df = employee[employee['firstName'].str.match(r'(^[a-zA-Z]arry)')==True] # [a-zA-Z] regex command for only letters
df

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
15,1501,Bott,Larry,x2311,lbott@classicmodelcars.com,7,1102.0,Sales Rep
16,1504,Jones,Barry,x102,bjones@classicmodelcars.com,7,1102.0,Sales Rep

#### Mostra tutti i prodotti che hanno una scala disivibile per 10 e minore di 100 (es: 1:10, 1:20, 1:30,...)

In [276]:
df = product[product['productScale'].str.contains(r'(^1:[0-9]0$)')==True] # [0-9] regex command for only numbers
df.head(3)

/tmp/ipykernel_1013/203303496.py:1: UserWarning: This pattern is interpreted as a regular expression, and has match groups. To actually get the groups, use str.extract.
  df = product[product['productScale'].str.contains(r'(^1:[0-9]0$)')==True] # [0-9] regex command for only numbers

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
0,S10_1678,1969 Harley Davidson Ultimate Chopper,Motorcycles,1:10,Min Lin Diecast,"This replica features working kickstand, front...",7933,48.81,95.70
1,S10_1949,1952 Alpine Renault 1300,Classic Cars,1:10,Classic Metal Creations,"Turnable front wheels, steering function, deta...",7305,98.58,214.30
2,S10_2016,1996 Moto Guzzi 1100i,Motorcycles,1:10,Highway 66 Mini Classics,"Official Moto Guzzi logos and insignias, saddl...",6625,68.99,118.94

#### Mostra tutti i dipendenti il cui nome inizia con M e la cui terza lettera è una r

In [277]:
df = employee[employee['firstName'].str.match(r'(^M[a-zA-Z]r.*)')==True] # [0-9] regex command for only numbers
df

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
22,1702,Gerard,Martin,x2312,mgerard@classicmodelcars.com,4,1102.0,Sales Rep

#### MOSTRA I MODELLINI CHE COSTANO MENO DI 75 E CHE ABBIAMO COMPRATO A PIÙ DI 30

In [278]:
df = product.loc[(product['MSRP'] < 75) & (product['buyPrice'] > 30)][['productName', 'MSRP', 'buyPrice']]
df.head(3)

           productName   MSRP  buyPrice
26  1911 Ford Town Car  60.54     33.30
35  1934 Ford V8 Coupe  62.46     34.35
46    1957 Vespa GS150  62.17     32.95

MOSTRA I MODELLINI CHE COSTANO MENO DI 75 O
PIÙ DI 150

In [279]:
df = product.loc[(product['MSRP'] < 75) | (product['MSRP'] > 150)][['productName', 'MSRP', 'buyPrice']]
df.head()

                            productName    MSRP  buyPrice
1              1952 Alpine Renault 1300  214.30     98.58
3  2003 Harley-Davidson Eagle Drag Bike  193.66     91.02
6                     1968 Ford Mustang  194.57     95.34
7                     2001 Ferrari Enzo  207.80     95.59
9                      2002 Suzuki XREO  150.62     66.27

MOSTRA I MODELLINI CHE COSTANO MENO DI 75 O
PIÙ DI 150 E CHE COMUNQUE ABBIAMO COMPRATO A
PIÙ DI 30

In [280]:
df = product.loc[(product['MSRP'] < 75) | (product['MSRP'] > 150) & (product['buyPrice'] > 30)][['productName', 'MSRP', 'buyPrice']]
df.head()

                            productName    MSRP  buyPrice
1              1952 Alpine Renault 1300  214.30     98.58
3  2003 Harley-Davidson Eagle Drag Bike  193.66     91.02
6                     1968 Ford Mustang  194.57     95.34
7                     2001 Ferrari Enzo  207.80     95.59
9                      2002 Suzuki XREO  150.62     66.27

PRENDI TUTTI I DIPENDENTI IL CUI NOME INIZIA CON
UNA LETTERA TRA B ED F

In [281]:
df = employee.loc[(employee['firstName'].str.match(r'^[B-F]'))]
df.head(3)

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
10,1286,Tseng,Foon Yue,x2248,ftseng@classicmodelcars.com,3,1143.0,Sales Rep
16,1504,Jones,Barry,x102,bjones@classicmodelcars.com,7,1102.0,Sales Rep

MOSTRA CODICE UFFICIO, CITTÀ E NUMERO DI
TELEFONO DEGLI UFFICI IN FRANCIA O AMERICA

In [282]:
office.dtypes

officeCode       int64
city            object
phone           object
addressLine1    object
addressLine2    object
state           object
country         object
postalCode      object
territory       object
dtype: object

In [283]:
df = office.loc[(office['country'].str.match('France')) | (office['country'].str.match('USA'))]
df.head(3)

,officeCode,city,phone,addressLine1,addressLine2,state,country,postalCode,territory
0,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NaN
1,2,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,2107,NaN
2,3,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,USA,10022,NaN

MOSTRARE I MODELLINI DEL TIPO "PLANES",
"SHIPS" O "CLASSIC CARS"

In [284]:
df = product.loc[(product['productLine'].str.match('Planes')) | 
                    (product['productLine'].str.match('Ships')) |
                    (product['productLine'].str.match('Classic Cars'))]

df.head(3)

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
1,S10_1949,1952 Alpine Renault 1300,Classic Cars,1:10,Classic Metal Creations,"Turnable front wheels, steering function, deta...",7305,98.58,214.30
4,S10_4757,1972 Alfa Romeo GTA,Classic Cars,1:10,Motor City Art Classics,"Features include: Turnable front wheels, steer...",3252,85.68,136.00
5,S10_4962,1962 LanciaA Delta 16V,Classic Cars,1:10,Second Gear Diecast,"Features include: Turnable front wheels, steer...",6791,103.42,147.74

MOSTRA GLI ORDINI NON SPEDITI

In [285]:
order.shippedDate

0      2003-01-10
1      2003-01-11
2      2003-01-14
3      2003-02-02
4      2003-02-01
          ...
321           NaN
322           NaN
323           NaN
324           NaN
325           NaN
Name: shippedDate, Length: 326, dtype: object

In [286]:
df = order.loc[order['shippedDate'].isna()]
df.head(3)

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
67,10167,2003-10-23,2003-10-30,NaN,Cancelled,Customer called to cancel. The warehouse was n...,448
148,10248,2004-05-07,2004-05-14,NaN,Cancelled,Order was mistakenly placed. The warehouse not...,131
160,10260,2004-06-16,2004-06-22,NaN,Cancelled,Customer heard complaints from their customers...,357

MOSTRA GLI ORDINI CREATI DOPO IL 30/04/2005 E
NON SPEDITI

In [287]:
df = order.loc[(order['orderDate'] >= "2005-04-30") & (order['shippedDate'].isna())]
df.head(3)

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
314,10414,2005-05-06,2005-05-13,NaN,On Hold,Customer credit limit exceeded. Will ship when...,362
320,10420,2005-05-29,2005-06-07,NaN,In Process,NaN,282
321,10421,2005-05-29,2005-06-06,NaN,In Process,Custom shipping instructions were sent to ware...,124

MOSTRA I PREZZI DI VENDITA SENZA L’IVA (PREZZO /
1.22)

In [288]:
df = product[['productName', 'MSRP', 'buyPrice']].apply(lambda x: product['MSRP'].div(1.22))

MOSTRA I PRODOTTI CON UN MARGINE (PREZZO -
PREZZO ACQUISTO) SUPERIORE A 50

In [289]:
df = product.loc[product['MSRP'] - product['buyPrice'] > 50]

MOSTRA I PRODOTTI CON NOMI DI ALMENO 15
CARATTERI.

In [290]:
df = product.loc[product['productName'].str.len() >= 15]
df.head(3)

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
0,S10_1678,1969 Harley Davidson Ultimate Chopper,Motorcycles,1:10,Min Lin Diecast,"This replica features working kickstand, front...",7933,48.81,95.70
1,S10_1949,1952 Alpine Renault 1300,Classic Cars,1:10,Classic Metal Creations,"Turnable front wheels, steering function, deta...",7305,98.58,214.30
2,S10_2016,1996 Moto Guzzi 1100i,Motorcycles,1:10,Highway 66 Mini Classics,"Official Moto Guzzi logos and insignias, saddl...",6625,68.99,118.94

MOSTRA I PRODOTTI ORINATI NEL MESE DI GENNAIO

In [335]:
order.head(3)

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,NaN,363
1,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128
2,10102,2003-01-10,2003-01-18,2003-01-14,Shipped,NaN,181

In [338]:
df = order.loc[pd.to_datetime(order['orderDate']).dt.month == 1]
df.head(3)

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,NaN,363
1,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128
2,10102,2003-01-10,2003-01-18,2003-01-14,Shipped,NaN,181

MOSTRA I MODELLINI ORDINANDOLI PER PREZZO DI
VENDITA CRESCENTE

In [340]:
df = product.sort_values(by = 'MSRP')
df.head(3)

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
60,S24_1937,1939 Chevrolet Deluxe Coupe,Vintage Cars,1:24,Motor City Art Classics,This 1:24 scale die-cast replica of the 1939 C...,7332,22.57,33.19
67,S24_2840,1958 Chevy Corvette Limited Edition,Classic Cars,1:24,Carousel DieCast Legends,The operating parts of this 1958 Chevy Corvett...,2542,15.91,35.36
70,S24_2972,1982 Lamborghini Diablo,Classic Cars,1:24,Second Gear Diecast,"This replica features opening doors, superb de...",7723,16.24,37.76

MOSTRA I CLIENTI ORDINANDOLI PER PAESE
CRESCENTE E CREDITO MASSIMO DECRESCENTE

In [353]:
df = customer.sort_values(by=['country', 'creditLimit'], ascending=[True, False])

MOSTRA GLI ORDINI ORDINANDOLI IN BASE ALLO
STATUS IN CUI SI TROVANO (IN CORSO, IN ATTESA,
CANCELLATI, ECC).

In [358]:
custom_dict = {'In Process': 0,
                'On Hold': 1, 
                'Cancelled': 2, 
                'Resolved': 3,
                'Disputed': 4,
                'Shipped': 5}

df = order.sort_values(by=['status'], key=lambda x: x.map(custom_dict))
df.head(3)

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
325,10425,2005-05-31,2005-06-07,NaN,In Process,NaN,119
323,10423,2005-05-30,2005-06-05,NaN,In Process,NaN,314
322,10422,2005-05-30,2005-06-11,NaN,In Process,NaN,157

MOSTRA I PRODOTTI VENDUTI A MENO DI 100€,
METTENDO IN CIMA QUELLI CON IL MARGINE PIÙ
ALTO

In [366]:
df = product.loc[product['MSRP'] < 100].sort_values('MSRP', ascending=False)
df.head(3)

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
85,S32_1374,1997 BMW F650 ST,Motorcycles,1:32,Exoto Designs,Features official die-struck logos and baked e...,178,66.92,99.89
100,S700_2466,America West Airlines B757-200,Planes,1:700,Motor City Art Classics,Official logos and insignias. Working steering...,9653,68.80,99.72
106,S700_3962,The Queen Mary,Ships,1:700,Welly Diecast Productions,Exact replica. Wood and Metal. Many extras inc...,5088,53.63,99.31

![Drag Racing](picture/MySQL-Sample-Database-Schema.png)

![Drag Racing](picture/join.png)

MOSTRA PER OGNI CLIENTE IL NOME DEL
VENDITORE ASSOCIATO

In [423]:
df = pd.merge(customer, employee, left_on='salesRepEmployeeNumber', right_on='employeeNumber')[['customerName', 'lastName']]

df.head(3)

             customerName   lastName
0       Atelier graphique  Hernandez
1       La Rochelle Gifts  Hernandez
2  Euro+ Shopping Channel  Hernandez

MOSTRA TUTTI GLI IMPIEGATI E LA CITTÀ IN CUI SI
TROVA L’UFFICIO CUI AFFERISCONO

In [419]:
df = employee.merge(office)[['lastName', 'firstName', 'employeeNumber', 'city']] # natural join
df.head(3)

    lastName firstName  employeeNumber           city
0     Murphy     Diane            1002  San Francisco
1  Patterson      Mary            1056  San Francisco
2   Firrelli      Jeff            1076  San Francisco

MOSTRA TUTTI I CLIENTI; SE IL CLIENTE HA UN
VENDITORE ASSOCIATO, MOSTRANE I DATI

In [427]:
df = pd.merge(customer, employee, left_on='salesRepEmployeeNumber', right_on='employeeNumber', how='left')[['customerName', 'lastName']]

df.head(3)

                 customerName   lastName
0           Atelier graphique  Hernandez
1          Signal Gift Stores   Thompson
2  Australian Collectors, Co.     Fixter

MOSTRA TUTTI I CLIENTI ED I RELATIVI ORDINI,
INCLUSI I CLIENTI CHE NON HANNO FATTO ORDINI

In [436]:
df = pd.merge(customer, order, on=['customerNumber'], how='left')[['customerNumber', 'customerName',
                                                                        'orderNumber', 'status']]
df.head(3)

   customerNumber       customerName  orderNumber   status
0             103  Atelier graphique      10123.0  Shipped
1             103  Atelier graphique      10298.0  Shipped
2             103  Atelier graphique      10345.0  Shipped

MOSTRA TUTTI I CLIENTI CHE NON HANNO ORDINI

In [444]:
df = pd.merge(customer, order, on=['customerNumber'], how='left')[['customerNumber', 'customerName',
                                                                        'orderNumber', 'status']]
mask = df.status.isna()
df = df[mask]

df.head(3)

     customerNumber            customerName  orderNumber status
36              125      Havel & Zbyszek Co          NaN    NaN
110             168  American Souvenirs Inc          NaN    NaN
111             169       Porto Imports Co.          NaN    NaN